nickray/lpc55-sdk-2.7.1/boards/lpcxpresso55s69/driver_examples/powerquad/benchmark_vector/cm33_core0/powerquad_benchmark_vector.c
static void PQ_VectorCosQ15Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    q15_t input[VECTOR_INPUT_LEN];
    q15_t result[VECTOR_INPUT_LEN];
    q15_t ref[VECTOR_INPUT_LEN];
    float inputFloat;

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        inputFloat = ((float)i * 2.0f / (float)VECTOR_INPUT_LEN) - 1.0f;
        input[i]   = FLOAT_2_Q15(inputFloat);
        ref[i]     = FLOAT_2_Q15(cos(inputFloat * MATH_PI));
    }

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorCosQ15(input, result, VECTOR_INPUT_LEN);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(result[i] - ref[i]) <= 2);
    }
}

/* High performance vector functions */
static void PQ_VectorLnFPTest(void)
{
    float32_t input[32]  = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6,
                           1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    float32_t result[32] = {0};
    float32_t lnRef[32]  = {0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760,
                           0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760,
                           0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760,
                           0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32LnFP(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(lnRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorLnFXTest(void)
{
    q31_t input[32]  = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    q31_t result[32] = {0};
    q31_t lnRef[32]  = {0, 1, 1, 1, 2, 2, 2, 2, 0, 1, 1, 1, 2, 2, 2, 2, 0, 1, 1, 1, 2, 2, 2, 2, 0, 1, 1, 1, 2, 2, 2, 2};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32LnFX(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(lnRef[i] == result[i]);
    }
}

static void PQ_VectorInvFPTest(void)
{
    float32_t input[32]  = {1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20,
                           1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20};
    float32_t result[32] = {0};
    float32_t invRef[32] = {1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05, 1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05,
                            1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05, 1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32InvFP(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(invRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorInvFXTest(void)
{
    q31_t input[32] = {
        1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20,
    };
    q31_t result[32] = {0};
    q31_t invRef[32] = {1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32InvFX(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(invRef[i] == result[i]);
    }
}

/* Float Vector Sqrt */
static void PQ_VectorSqrtFPTest(void)
{
    float32_t input[32]   = {0.04, 0.25, 1, 4, 9, 16, 144, 1.69, 0.04, 0.25, 1, 4, 9, 16, 144, 1.69,
                           0.04, 0.25, 1, 4, 9, 16, 144, 1.69, 0.04, 0.25, 1, 4, 9, 16, 144, 1.69};
    float32_t result[32]  = {0};
    float32_t sqrtRef[32] = {0.2, 0.5, 1, 2, 3, 4, 12, 1.3, 0.2, 0.5, 1, 2, 3, 4, 12, 1.3,
                             0.2, 0.5, 1, 2, 3, 4, 12, 1.3, 0.2, 0.5, 1, 2, 3, 4, 12, 1.3};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32SqrtFP(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(sqrtRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorSqrtFXTest(void)
{
    q31_t input[32]   = {0, 1, 1, 4, 144, 169, 144, 169, 0, 1, 1, 4, 144, 169, 144, 169,
                       0, 1, 1, 4, 144, 169, 144, 169, 0, 1, 1, 4, 144, 169, 144, 169};
    q31_t result[32]  = {0};
    q31_t sqrtRef[32] = {0, 1, 1, 2, 12, 13, 12, 13, 0, 1, 1, 2, 12, 13, 12, 13,
                         0, 1, 1, 2, 12, 13, 12, 13, 0, 1, 1, 2, 12, 13, 12, 13};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32SqrtFX(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(sqrtRef[i] == result[i]);
    }
}

static void PQ_VectorInvSqrtFPTest(void)
{
    float32_t input[32]      = {4, 1, 1, 0.25, 16, 100, 16, 100, 4, 1, 1, 0.25, 16, 100, 16, 100,
                           4, 1, 1, 0.25, 16, 100, 16, 100, 4, 1, 1, 0.25, 16, 100, 16, 100};
    float32_t result[32]     = {0};
    float32_t invSqrtRef[32] = {0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1, 0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1,
                                0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1, 0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_Vector32InvSqrtFP(input, result);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 32; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(invSqrtRef[i] - result[i]) < 0.00001);
    }
}

